import PhraseAnalysis from './PhraseAnalysis';

export const _1500_калорий_в_день = PhraseAnalysis.create([
    { text: '1500' },
    { text: ' ' },
    {
        analysis: [{ lex: 'калория', gr: 'S,жен,неод=род,мн' }],
        text: 'калорий'
    },
    { text: ' ' },
    {
        analysis: [
            { lex: 'в', gr: 'PR=' },
            {
                lex: 'в',
                gr:
                    'S,сокр=(пр,мн|пр,ед|вин,мн|вин,ед|дат,мн|дат,ед|род,мн|род,ед|твор,мн|твор,ед|им,мн|им,ед)'
            }
        ],
        text: 'в'
    },
    { text: ' ' },
    {
        analysis: [
            { lex: 'день', gr: 'S,муж,неод=(вин,ед|им,ед)' },
            { lex: 'девать', gr: 'V=ед,пов,2-л,сов' }
        ],
        text: 'день'
    },
    { text: '\n' }
]);

export const я_съел_яблоко = PhraseAnalysis.create([
    {
        analysis: [
            { lex: 'я', gr: 'SPRO,ед,1-л=им' },
            {
                lex: 'я',
                gr:
                    'S,сокр=(пр,мн|пр,ед|вин,мн|вин,ед|дат,мн|дат,ед|род,мн|род,ед|твор,мн|твор,ед|им,мн|им,ед)'
            }
        ],
        text: 'я'
    },
    { text: ' ' },
    {
        analysis: [{ lex: 'съедать', gr: 'V=прош,ед,изъяв,муж,сов' }],
        text: 'съел'
    },
    { text: ' ' },
    {
        analysis: [{ lex: 'яблоко', gr: 'S,сред,неод=(вин,ед|им,ед)' }],
        text: 'яблоко'
    },
    { text: '\n' }
]);

export const дворе_стали_маша = PhraseAnalysis.create([
    { analysis: [{ lex: 'двор', gr: 'S,муж,неод=пр,ед' }], text: 'дворе' },
    {
        analysis: [
            { lex: 'становиться', gr: 'V,нп=прош,мн,изъяв,сов' },
            {
                lex: 'сталь',
                gr: 'S,жен,неод=(пр,ед|вин,мн|дат,ед|род,ед|им,мн)'
            }
        ],
        text: 'стали'
    },
    {
        analysis: [
            { lex: 'маша', gr: 'S,имя,жен,од=им,ед' },
            { lex: 'махать', gr: 'V,несов,нп=непрош,деепр' }
        ],
        text: 'маша'
    }
]);

export const я_съел_42_калории = PhraseAnalysis.create([
    {
        analysis: [
            { lex: 'я', gr: 'SPRO,ед,1-л=им' },
            {
                lex: 'я',
                gr:
                    'S,сокр=(пр,мн|пр,ед|вин,мн|вин,ед|дат,мн|дат,ед|род,мн|род,ед|твор,мн|твор,ед|им,мн|им,ед)'
            }
        ],
        text: 'я'
    },
    { text: ' ' },
    { analysis: [{ lex: 'съедать', gr: 'V=прош,ед,изъяв,муж,сов' }], text: 'съел' },
    { text: ' ' },
    { text: '42' },
    { text: ' ' },
    {
        analysis: [{ lex: 'калория', gr: 'S,жен,неод=(пр,ед|вин,мн|дат,ед|род,ед|им,мн)' }],
        text: 'калории'
    },
    { text: '\n' }
]);

export const сколько_у_меня_осталось = PhraseAnalysis.create([
    {
        analysis: [
            { lex: 'сколько', gr: 'ADV=' },
            { lex: 'скольким', gr: 'NUM=' },
            { lex: 'сколько', gr: 'CONJ=' }
        ],
        text: 'сколько'
    },
    { text: ' ' },
    {
        analysis: [
            { lex: 'у', gr: 'PR=' },
            { lex: 'у', gr: 'INTJ=' },
            {
                lex: 'у',
                gr:
                    'S,сокр=(пр,мн|пр,ед|вин,мн|вин,ед|дат,мн|дат,ед|род,мн|род,ед|твор,мн|твор,ед|им,мн|им,ед)'
            }
        ],
        text: 'у'
    },
    { text: ' ' },
    {
        analysis: [
            { lex: 'я', gr: 'SPRO,ед,1-л=(вин|род)' },
            { lex: 'мень', gr: 'S,фам,муж,од=(вин,ед|род,ед)' }
        ],
        text: 'меня'
    },
    { text: ' ' },
    { analysis: [{ lex: 'оставаться', gr: 'V,нп=прош,ед,изъяв,сред,сов' }], text: 'осталось' },
    { text: '\n' }
]);

export const сколько_осталось = PhraseAnalysis.create([
    {
        analysis: [
            { lex: 'сколько', gr: 'ADV=' },
            { lex: 'скольким', gr: 'NUM=' },
            { lex: 'сколько', gr: 'CONJ=' }
        ],
        text: 'сколько'
    },
    { text: ' ' },
    { analysis: [{ lex: 'оставаться', gr: 'V,нп=прош,ед,изъяв,сред,сов' }], text: 'осталось' },
    { text: '\n' }
]);
